In [1]:
import pandas as pd

In [5]:
data = [['Juan',36], ['Pedro', 47]]
df=pd.DataFrame(data,columns=['Nombre','Edad'])
type(df)
print(df)

  Nombre  Edad
0   Juan    36
1  Pedro    47

In [11]:
data= {

'Nombre':['Juan', 'Pedro'],
'Edad':[36,47]

}

df= pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    36
1  Pedro    47

In [13]:
##Leer archivos csv sin cabecera

df=pd.read_csv('./data/data_without_header', header=None, names=['Nombre','Edad','Ciudad'])
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [7]:
##Leer datos de csv formateados
df= pd.read_csv('./data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [12]:
##Leer datos de csv formateados  con separados
df= pd.read_csv('./data/data.csv',sep='|')
df

   nombre,edad,ciudad
0      Juan,25,Madrid
1  María,30,Barcelona
2    Pedro,35,Sevilla

In [14]:
##leer Json

df= pd.read_json('./data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [16]:
##Muestra el top

df.head(1)

  nombre  edad  ciudad
0   Juan    25  Madrid

In [18]:
df.tail(1)

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [ ]:
##Listar Columnas

df.columns

In [19]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [21]:
df.info

<bound method DataFrame.info of   nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla>

In [27]:
##Manupulacion de datos, seleccion Columnas -Serie
##df['nombre'] para un solo campo
df[['nombre','edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [31]:
##Seleccionar Filas

##Manupulacion de datos, seleccion Columnas

#df.loc[[0,2]]  #Varias columnas
df[df['edad']>25]  #Varias columnas

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [38]:
##Operaciones

data={
    'grupo':['a','b','c','a','b','c', 'a','b','c'],
    'valor':[1,2,3,4,5,6,7,8,9]
}

df = pd.DataFrame(data)
df.groupby('grupo').mean()
df.groupby('grupo').sum()

       valor
grupo
a         12
b         15
c         18

In [45]:
#Uso de funciones dentro de un dataframe 

data={
    'A':[1,2,3,4,5],
    'B':[11,12,13,14,15]

}

#df=pd.DataFrame(data)
#df['A_double']=df['A'].apply(lambda x: x*2)
#df

def duplicar(n):
    return n*2

df['A_double']=df['A'].apply(duplicar)
df

   A   B  A_double
0  1  11         2
1  2  12         4
2  3  13         6
3  4  14         8
4  5  15        10

In [46]:
#Uso de funciones dentro de un dataframe 

data={
    'A':[1,2,3,4,5],
    'B':[11,12,13,14,15]

}

#df=pd.DataFrame(data)
#df['A_double']=df['A'].apply(lambda x: x*2)
#df


#sumar filas
def suma(row):
    return row['A']+row['B']

df['Suma']=df['A'].apply(suma)
df

TypeError: 'int' object is not subscriptable